Tekla.Structures.Drawing.CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes
The CurvedDimensionSetRadialAttributes class contains the attributes for managing all the attributes
of the curved dimension with radial reference lines.

Tekla.Structures.Drawing.CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes.CurvedDimensionType
The curved dimension type.

Tekla.Structures.Drawing.CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes.DimensionType
The dimension type.

Tekla.Structures.Drawing.CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes.#ctor
Creates a new curved dimension set radial attributes instance which loads standard attributes.

Tekla.Structures.Drawing.CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes.#ctor(System.Boolean)
Creates a new curved dimension set radial attributes instance which loads standard attributes.
SkipLoadingAttributes: If it set to true attributes won't be lodaded.

Tekla.Structures.Drawing.CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes.#ctor(System.String)
Creates a new curved dimension set radial attributes instance that loads the specified attributes.
AttributesFile: The attributes file's filename.

Tekla.Structures.Drawing.CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
attributeFilename: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.